/*
 *             Задача №2 Учет посещений:
    Разработайте программу для учета посещений магазина. 
    Используйте Dictionary для отслеживания количества посещений для каждого клиента.
    Пользователь вводит имя, а словарь увеличивает счетчик посещений.
    При вводе слова “выход”, выводится список всех клиентов и количества их посещений
 */

Dictionary<string, int> nameVisit = new Dictionary<string, int>();
int count = 0;
while (true)
{
    Console.Write("Введите имя: ");

}