// 2. Вывести на одной строке числа 1, 13 и 49 с одним пробелом междуними.

Console.Write("1 13 49");

Console.WriteLine("\n\nНажмите любую клавишу для завершения...");
Console.ReadKey();
