/*
    Напишите программу, в которой есть базовый класс с открытым целочисленным полем. 
    В классе описан виртуальный индексатор, позволяющий считывать цифры в десятичном 
    представлении числа (значение поля). 
    На основе базового класса создается производный класс, в котором появляется еще 
    одно открытое целочисленное поле. 
    В производном классе описывается версия индексатора с двумя индексами: 
    первый индекс определяет поле, значение которого используется, а второй индекс определяет разряд, 
    для которого считывается цифра. 
    Индексатор с одним индексом переопределяется так, что вычисления (считывание цифры в десятичном 
    представлении числа) производятся на основе значения, равного сумме значений полей индексируемого 
    объекта.
 */