/*
                                     Домашняя работа
Построить три класса (базовый и 3 потомка), 
описывающих некоторых хищных животных (один из потомков), 
всеядных(второй потомок) и 
травоядных (третий потомок). 

Описать в базовом классе абстрактный метод для расчета количества и типа пищи, необходимого для пропитания животного в зоопарке.
Упорядочить всю последовательность животных по убыванию количества пищи. 
При совпадении значений – упорядочивать данные по алфавиту по имени. 
Вывести идентификатор животного, имя, тип и количество потребляемой пищи для всех элементов списка.
Вывести первые 5 имен животных из полученного в пункте а) списка.
Вывести последние 3 идентификатора животных из полученного в пункте 1. списка.
Организовать запись и чтение коллекции в/из файл.
Организовать обработку некорректного формата входного файла.
 */
Console.WriteLine(new string('-',127) +  '|');
//abstract class Animals
//{
//    public string Name { get; set;}
//    public int Food { get; set;}

//    public Animals (string name, int food)
//    {
//        Name = name;
//        Food = food;
//    }

//    public void FoodEat()
//    {

//    }
//}

//class Predators : Animals
//{
//    public 
//}

