using Work_1;
// Домашняя работа
// 1.	Задача на взаимодействие между классами.
// Разработать систему «Вступительные экзамены».
// Абитуриент регистрируется на Факультет, сдает Экзамены.
// Преподаватель выставляет Оценку.
// Система подсчитывает средний бал и определяет Абитуриента,
// зачисленного в учебное заведение.



Abiturient ivanov = new ("Иванов");
Facult oop = new("ООП");
Facult c = new("с#");
Facult bd = new("Базы данных");
Teacher teacher = new("Преподователь");


//oop.Exam!.Mark = 5;

