/*
                                        Домашняя работа
Создайте запись (Record) с именем student, содержащую поля: 
фамилия и инициалы, номер группы, успеваемость (массив из пяти элементов). 
Создать массив из десяти элементов такого типа, упорядочить записи по возрастанию среднего балла. 
Добавить возможность вывода фамилий и номеров групп студентов, имеющих оценки, равные только 4 или 5.
*/


record Student
{
    public string name;
    public string inicial;
    public int group;
    public int mark;
}

