// Домашняя работа
// 1.	Создать класс Liquid (жидкость), имеющий поля названия и плотности.
// Определить методы переназначения и изменения плотности.
// Создать производный класс Alcohol (спирт), имеющий крепость.
// Определить методы переназначения и изменения крепости.
// 2.	Создать класс Pair (пара чисел);
// определить методы изменения полей и вычисления произведения чисел.
// Определить производный класс Rectangle (прямоугольник) с полями-сторонами.
// Определить методы вычисления периметра и площади прямоугольника.





