// Домашняя работа

// 1.	Составить описание класса для представления времени.
// Предусмотреть возможности установки времени и изменения
// его отдельных полей (час, минута, секунда) с проверкой
// допустимости вводимых значений.
// В случае недопустимых значений полей выбрасываются исключения.
// Создать методы изменения времени на заданное количество
// часов, минут и секунд.

// 2.	Описать класс, представляющий треугольник.
// Предусмотреть методы для создания объектов, вычисления площади,
// периметра и точки пересечения медиан. Описать методы для
// получения состояния объекта.



