// Домашняя работа

// Создать класс, содержащий динамический массив и количество элементов в нем.
// Добавить конструктор, который выделяет память под заданное количество элементов, и деструктор.
// Добавить методы, позволяющие заполнять массив случайными числами, переставлять в данном массиве
// элементы в случайном порядке, находить количество различных элементов в массиве, выводить массив на экран.

// Описать класс «домашняя библиотека».
// Предусмотреть возможность работы с произвольным числом книг, поиска книги по какому-либо признаку
// (например, по автору или по году издания), добавления книг в библиотеку, удаления книг из нее,
// сортировки книг по разным полям.

